src/module/hotel/soapXML/hotelSearch.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
   <soapenv:Header/>
   <soapenv:Body>
     <HotelSearchAvailabilityReq xmlns="http://www.travelport.com/schema/hotel_v52_0" TraceId="--TraceId--" AuthorizedBy="Travelport" TargetBranch="--TargetBranch--">
  <BillingPointOfSaleInfo xmlns="http://www.travelport.com/schema/common_v52_0" OriginApplication="uAPI" />
  <HotelSearchLocation>
    <HotelLocation Location="--HotelLoc--" />
    <ReferencePoint>--ReferencePoint--</ReferencePoint>
  </HotelSearchLocation>
  <HotelSearchModifiers PreferredCurrency="--Base--" NumberOfAdults="--Adults--" NumberOfRooms="--Rooms--" AvailableHotelsOnly="--AvailableHotelsOnly--">
    <PermittedProviders xmlns="http://www.travelport.com/schema/common_v52_0">
      <Provider Code="--Provider--" />
    </PermittedProviders>
    --HotelRatingRange--
    --NumberOfChildren--
  </HotelSearchModifiers>
  <HotelStay>
    <CheckinDate>--To--</CheckinDate>
    <CheckoutDate>--From--</CheckoutDate>
  </HotelStay>
  <!-- <HotelBedding Type="RollawayAdult" />
    <HotelBedding Type="Crib" />
    <NumberOfChildren Count="2">
      <Age>2</Age>
      <Age>4</Age>
    </NumberOfChildren> -->
</HotelSearchAvailabilityReq>
   </soapenv:Body>
</soapenv:Envelope>